Terraform plan for __dev__
<details>
  <summary>Plan: 8 to add, 0 to change, 8 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_dns_record_set.inventory_postgres_a_record must be replaced
-/+ resource "google_dns_record_set" "inventory_postgres_a_record" {
      ~ id           = "********************************************************************************************************************" -> (known after apply)
        name         = "inventory.postgres.commerce.internal."
      ~ rrdatas      = [ # forces replacement
          - "10.4.0.3",
          + (known after apply),
        ]
        # (4 unchanged attributes hidden)
    }

  # module.inventory_google_postgres.google_sql_database.additional_databases["inventory-qa"] must be replaced
-/+ resource "google_sql_database" "additional_databases" {
      ~ id        = "***************************************************************************" -> (known after apply)
      ~ instance  = "inventory-78c73acd" -> "ibo-dev-db-78c73acd" # forces replacement
        name      = "inventory-qa"
      ~ self_link = "https://sqladmin.googleapis.com/sql/v1beta4/projects/ebo-dev-321910/instances/inventory-78c73acd/databases/inventory-qa" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.inventory_google_postgres.google_sql_database.default[0] must be replaced
-/+ resource "google_sql_database" "default" {
      ~ id        = "************************************************************************" -> (known after apply)
      ~ instance  = "inventory-78c73acd" -> "ibo-dev-db-78c73acd" # forces replacement
        name      = "inventory"
      ~ self_link = "https://sqladmin.googleapis.com/sql/v1beta4/projects/ebo-dev-321910/instances/inventory-78c73acd/databases/inventory" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.inventory_google_postgres.google_sql_database_instance.default must be replaced
-/+ resource "google_sql_database_instance" "default" {
      ~ connection_name               = "ebo-dev-321910:asia-south1:inventory-78c73acd" -> (known after apply)
      + encryption_key_name           = (known after apply)
      ~ first_ip_address              = "10.4.0.3" -> (known after apply)
      ~ id                            = "******************" -> (known after apply)
      ~ ip_address                    = [
          - {
              - ip_address     = "10.4.0.3"
              - time_to_retire = ""
              - type           = "PRIVATE"
            },
        ] -> (known after apply)
      + master_instance_name          = (known after apply)
      ~ name                          = "inventory-78c73acd" -> "ibo-dev-db-78c73acd" # forces replacement
      ~ private_ip_address            = "10.4.0.3" -> (known after apply)
      + public_ip_address             = (known after apply)
      ~ self_link                     = "https://sqladmin.googleapis.com/sql/v1beta4/projects/ebo-dev-321910/instances/inventory-78c73acd" -> (known after apply)
      ~ server_ca_cert                = [
          - {
              - cert             = <<-EOT
                    -----BEGIN CERTIFICATE-----
                    MIIDfzCCAmegAwIBAgIBADANBgkqhkiG9w0BAQsFADB3MS0wKwYDVQQuEyQ4NWE2
                    MzQzOC04MDAzLTRjNGEtOWUwZi1iOTBjZDNjNjY0YWMxIzAhBgNVBAMTGkdvb2ds
                    ZSBDbG91ZCBTUUwgU2VydmVyIENBMRQwEgYDVQQKEwtHb29nbGUsIEluYzELMAkG
                    A1UEBhMCVVMwHhcNMjEwOTIxMDcwMDI4WhcNMzEwOTE5MDcwMTI4WjB3MS0wKwYD
                    VQQuEyQ4NWE2MzQzOC04MDAzLTRjNGEtOWUwZi1iOTBjZDNjNjY0YWMxIzAhBgNV
                    BAMTGkdvb2dsZSBDbG91ZCBTUUwgU2VydmVyIENBMRQwEgYDVQQKEwtHb29nbGUs
                    IEluYzELMAkGA1UEBhMCVVMwggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEKAoIB
                    AQCBMEg6g7cS9WQyO4PcVAT59Ne7iDt9PYlYDOIMDbAuvVa+cVbP2BQg4WK3nT+W
                    IaoeXFbKN+iBnOgbA8gCXgrAC9CjOsPAceHoqMqHnH83t7R4SDy3gxSva6t3NS1Z
                    qbgcXMGafGKcwIKgPT1Z3/1nuvXo6HcW2X5VTTg1lWjMqzzKvvY9PHIJjoZX9Lhf
                    sHOg1/7HloxYowVxsOVNQjae/yv9kXbuYO/cdW0ZeRJsNlYoGBv9pnveJnQOG99d
                    LboUjq6W0dHos4+VplJpZHmAMgbp7iKUF4lpNbJSrt7WTH99SVvw8vXBiLilz9ks
                    GyZmN2otdxCXuMNolTZCnKhBAgMBAAGjFjAUMBIGA1UdEwEB/wQIMAYBAf8CAQAw
                    DQYJKoZIhvcNAQELBQADggEBAELLU7xJQppfveO77sAkRO7ToHCIIHJ4R1S7Ol9J
                    i3CxJM2y5hCR6M8Q/5+4P1U1iri1MvJEQwUvoU8ZtOIUJgvoKX/e0XqLc9/S5+Qv
                    pqiS7q2cKxRrLjYnG3aXMzh6l0LKuWDFWOEhvcTz0tOVIbVBRp4FoUjC7AcTvCKV
                    N4uXZZAs9hflVszepGhMD1Hg7Z0IlZGo7gzlEUKWh+7dJLDPuQw3JIxePo8yMjJl
                    mxFtvpy08NVnwih1CDs9I2DSI3Yy+6Oig8M7iyP4Zow9gcNDYr5anDdLn75bYkbh
                    pdO+3o8/ukuI0Fh1HCsjA6I6hr/V4CcY1wvqgHVjt048X2M=
                    -----END CERTIFICATE-----
                EOT
              - common_name      = "C=US,O=Google\\, Inc,CN=Google Cloud SQL Server CA,dnQualifier=85a63438-8003-4c4a-9e0f-b90cd3c664ac"
              - create_time      = "2021-09-21T07:00:28.403Z"
              - expiration_time  = "2031-09-19T07:01:28.403Z"
              - sha1_fingerprint = "a50ba83d6f370a3bf67274c50dfaf59e38ce0b0d"
            },
        ] -> (known after apply)
      ~ service_account_email_address = "p548192617349-o55ojq@gcp-sa-cloud-sql.iam.gserviceaccount.com" -> (known after apply)
        # (4 unchanged attributes hidden)

      + replica_configuration {
          + ca_certificate            = (known after apply)
          + client_certificate        = (known after apply)
          + client_key                = (known after apply)
          + connect_retry_interval    = (known after apply)
          + dump_file_path            = (known after apply)
          + failover_target           = (known after apply)
          + master_heartbeat_period   = (known after apply)
          + password                  = (sensitive value)
          + ssl_cipher                = (known after apply)
          + username                  = (known after apply)
          + verify_server_certificate = (known after apply)
        }

      ~ settings {
          ~ authorized_gae_applications = [] -> (known after apply)
          ~ crash_safe_replication      = false -> (known after apply)
          ~ replication_type            = "SYNCHRONOUS" -> (known after apply)
          ~ version                     = 1 -> (known after apply)
            # (9 unchanged attributes hidden)

          ~ backup_configuration {
              ~ transaction_log_retention_days = 7 -> (known after apply)
                # (4 unchanged attributes hidden)

                # (1 unchanged block hidden)
            }

          ~ ip_configuration {
              ~ private_network = "projects/ebo-dev-321910/global/networks/ebo-dev-network" -> "https://www.googleapis.com/compute/v1/projects/ebo-dev-321910/global/networks/ebo-dev-network"
                # (2 unchanged attributes hidden)
            }

          ~ location_preference {
                # (1 unchanged attribute hidden)
            }

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.inventory_google_postgres.google_sql_user.additional_users["dev-read-user"] must be replaced
-/+ resource "google_sql_user" "additional_users" {
      + host     = (known after apply)
      ~ id       = "*********************************" -> (known after apply)
      ~ instance = "inventory-78c73acd" -> "ibo-dev-db-78c73acd" # forces replacement
        name     = "dev-read-user"
        # (2 unchanged attributes hidden)
    }

  # module.inventory_google_postgres.google_sql_user.default[0] must be replaced
-/+ resource "google_sql_user" "default" {
      + host     = (known after apply)
      ~ id       = "**************************************" -> (known after apply)
      ~ instance = "inventory-78c73acd" -> "ibo-dev-db-78c73acd" # forces replacement
        name     = "inventory-xsvr2zd1"
        # (2 unchanged attributes hidden)
    }

  # module.inventory_google_postgres.random_id.additional_passwords["dev-read-user"] must be replaced
-/+ resource "random_id" "additional_passwords" {
      ~ b64_std     = "************" -> (known after apply)
      ~ b64_url     = "***********" -> (known after apply)
      ~ dec         = "********************" -> (known after apply)
      ~ hex         = "****************" -> (known after apply)
      ~ id          = "***********" -> (known after apply)
      ~ keepers     = { # forces replacement
          ~ "name" = "inventory-78c73acd" -> "ibo-dev-db-78c73acd"
        }
        # (1 unchanged attribute hidden)
    }

  # module.inventory_google_postgres.random_id.user-password must be replaced
-/+ resource "random_id" "user-password" {
      ~ b64_std     = "************" -> (known after apply)
      ~ b64_url     = "***********" -> (known after apply)
      ~ dec         = "******************" -> (known after apply)
      ~ hex         = "****************" -> (known after apply)
      ~ id          = "***********" -> (known after apply)
      ~ keepers     = { # forces replacement
          ~ "name" = "inventory-78c73acd" -> "ibo-dev-db-78c73acd"
        }
        # (1 unchanged attribute hidden)
    }

Plan: 8 to add, 0 to change, 8 to destroy.

Warning: Provider kubernetes is undefined

  on jumpbox.tf line 3, in module "jumpbox":
   3:     kubernetes = kubernetes.gke

Module module.jumpbox does not declare a provider named kubernetes.
If you wish to specify a provider configuration for the module, add an entry
for kubernetes in the required_providers block within the module.
```
</details>

Plan generated in [Terraform #174](https://github.com/ebomart/commerce-infrastructure/actions/runs/1257415299)